<details><summary>Digger run report at 2024-04-01 08:13:54 (UTC)</summary>
  <details><summary>Apply for <b>develeap/iac-terragrunt-template#infrastructure-live_01234567890_prod_prod-1_il-central-1_compute_demo-ec2</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0fbd08534ff5a05ff"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-075ffae68d9b0487a"
      + tags                                 = {
          + "Name" = "prod.demo.ec2"
        }
      + tags_all                             = {
          + "AccountId"   = "006262944085"
          + "AccountName" = "lior.dux"
          + "Environment" = "prod"
          + "Name"        = "prod.demo.ec2"
          + "Objective"   = "Digger with Terragrunt"
          + "Owner"       = "Lior Dux"
          + "Region"      = "il-central-1"
          + "Terragrunt"  = "True"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "prod.demo.ec2"
        }
      + vpc_security_group_ids               = [
          + "sg-03a28927b740df64e",
        ]

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ami                                = "ami-0fbd08534ff5a05ff"
  + arn                                = (known after apply)
  + availability_zone                  = (known after apply)
  + capacity_reservation_specification = (known after apply)
  + ebs_block_device                   = (known after apply)
  + ephemeral_block_device             = (known after apply)
  + id                                 = (known after apply)
  + instance_state                     = (known after apply)
  + ipv6_addresses                     = (known after apply)
  + outpost_arn                        = (known after apply)
  + password_data                      = (known after apply)
  + primary_network_interface_id       = (known after apply)
  + private_dns                        = (known after apply)
  + private_ip                         = (known after apply)
  + public_dns                         = (known after apply)
  + public_ip                          = (known after apply)
  + root_block_device                  = (known after apply)
  + tags_all                           = {
      + AccountId   = "006262944085"
      + AccountName = "lior.dux"
      + Environment = "prod"
      + Name        = "prod.demo.ec2"
      + Objective   = "Digger with Terragrunt"
      + Owner       = "Lior Dux"
      + Region      = "il-central-1"
      + Terragrunt  = "True"
    }
aws_instance.this[0]: Creating...
aws_instance.this[0]: Still creating... [10s elapsed]
aws_instance.this[0]: Creation complete after 15s [id=i-005e9d6049c265929]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

ami = "ami-0fbd08534ff5a05ff"
arn = "arn:aws:ec2:il-central-1:006262944085:instance/i-005e9d6049c265929"
availability_zone = "il-central-1a"
capacity_reservation_specification = tolist([
  {
    "capacity_reservation_preference" = "open"
    "capacity_reservation_target" = tolist([])
  },
])
ebs_block_device = toset([])
ephemeral_block_device = toset([])
id = "i-005e9d6049c265929"
instance_state = "running"
ipv6_addresses = tolist([])
outpost_arn = ""
password_data = ""
primary_network_interface_id = "eni-0087cc8174d6fd80f"
private_dns = "ip-172-31-36-67.il-central-1.compute.internal"
private_ip = "172.31.36.67"
public_dns = "ec2-51-17-183-93.il-central-1.compute.amazonaws.com"
public_ip = "51.17.183.93"
root_block_device = tolist([
  {
    "delete_on_termination" = true
    "device_name" = "/dev/xvda"
    "encrypted" = false
    "iops" = 100
    "kms_key_id" = ""
    "tags" = tomap({})
    "tags_all" = tomap({})
    "throughput" = 0
    "volume_id" = "vol-0b356d3114697eded"
    "volume_size" = 8
    "volume_type" = "gp2"
  },
])
tags_all = tomap({
  "AccountId" = "006262944085"
  "AccountName" = "lior.dux"
  "Environment" = "prod"
  "Name" = "prod.demo.ec2"
  "Objective" = "Digger with Terragrunt"
  "Owner" = "Lior Dux"
  "Region" = "il-central-1"
  "Terragrunt" = "True"
})

	nnununununununununununununununununununununununununununununununnununununununununununununununununununununununununununununununnunununununununununununununununununununu
 	===================================================================Finished Running Terrafom=======================================================================
 	unununununununununununununununununununununununununununununununnununununununununununununununununununununununununununununununnunununununununununununununununununununu


  ```
</details>
</details>